# combining and Merging datasets

In [115]:
import pandas as pd

In [116]:
import numpy as np

In [117]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                'data1':range(7)})

In [118]:
df2=pd.DataFrame({'key':['a','b','d'],
                'data2':range(3)})

In [119]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [120]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [121]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [122]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [123]:
df3=pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],
                 'data1':range(7)})

In [124]:
df4=pd.DataFrame({'rkey':['a','b','d'],
                 'data2':range(3)})

In [125]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [126]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [127]:
df1=pd.DataFrame({'key':['b','b','a','c','a','b'],
                 'data1':range(6)})

In [128]:
df2=pd.DataFrame({'key':['a','b','a','b','d'],
                 'data1':range(5)})

In [129]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [130]:
df2

  key  data1
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [131]:
pd.merge(df1,df2,on='key',how='left')

   key  data1_x  data1_y
0    b        0      1.0
1    b        0      3.0
2    b        1      1.0
3    b        1      3.0
4    a        2      0.0
5    a        2      2.0
6    c        3      NaN
7    a        4      0.0
8    a        4      2.0
9    b        5      1.0
10   b        5      3.0

In [132]:
pd.merge(df1,df2,how='inner')

  key  data1
0   b      1
1   a      2

In [133]:
pd.merge(df1,df2,on='key',how='inner')

  key  data1_x  data1_y
0   b        0        1
1   b        0        3
2   b        1        1
3   b        1        3
4   b        5        1
5   b        5        3
6   a        2        0
7   a        2        2
8   a        4        0
9   a        4        2

In [134]:
left=pd.DataFrame({'key1':['foo','foo','bar'],
                  'key2':['one','two','one'],
                  'lval':[1,2,3]})

In [135]:
right=pd.DataFrame({'key1':['foo','foo','bar','bar'],
                  'key2':['one','one','one','two'],
                  'rval':[4,5,6,7]})

In [136]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [137]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [138]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

# merging on  index

In [139]:
left1=pd.DataFrame({'key':['a','b','a','a','b','c'],
                 'value':range(6)})

In [140]:
right1=pd.DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [141]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [142]:
right1

   group_val
a        3.5
b        7.0

In [143]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [144]:
pd.merge(left1,right1,left_on='key',right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [145]:
lefth=pd.DataFrame({'key1':['ohio','ohio','ohio','nevada','nevada'],
                   'key2':[2000,2001,2002,2001,2002],
                   'data':np.arange(5.)})

In [146]:
righth=pd.DataFrame(np.arange(12).reshape((6,2)),
                   index=[['nevada','nevada','ohio','ohio','ohio','ohio'],
                         [2001,2000,2000,2000,2001,2002]],
                   columns=['event1','event2'])

In [147]:
lefth

     key1  key2  data
0    ohio  2000   0.0
1    ohio  2001   1.0
2    ohio  2002   2.0
3  nevada  2001   3.0
4  nevada  2002   4.0

In [148]:
righth

             event1  event2
nevada 2001       0       1
       2000       2       3
ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [149]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

     key1  key2  data  event1  event2
0    ohio  2000   0.0       4       5
0    ohio  2000   0.0       6       7
1    ohio  2001   1.0       8       9
2    ohio  2002   2.0      10      11
3  nevada  2001   3.0       0       1

In [150]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True,how='outer')

     key1  key2  data  event1  event2
0    ohio  2000   0.0     4.0     5.0
0    ohio  2000   0.0     6.0     7.0
1    ohio  2001   1.0     8.0     9.0
2    ohio  2002   2.0    10.0    11.0
3  nevada  2001   3.0     0.0     1.0
4  nevada  2002   4.0     NaN     NaN
4  nevada  2000   NaN     2.0     3.0

In [151]:
left2=pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]],
                   index=['a','c','e'],
                   columns=['ohio','nevada'])

In [152]:
right2=pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14.]],
                   index=['b','c','d','e'],
                   columns=['missouri','alabama'])

In [153]:
left2

   ohio  nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [154]:
right2

   missouri  alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [155]:
pd.merge(left2,right2,how='outer',left_index=True,right_index=True)

   ohio  nevada  missouri  alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [156]:
left2.join(right2,how='outer')

   ohio  nevada  missouri  alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [157]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [158]:
another=pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],
                    index=['a','c','e','f'],
                    columns=['newyork','oregon'])

In [159]:
another

   newyork  oregon
a      7.0     8.0
c      9.0    10.0
e     11.0    12.0
f     16.0    17.0

In [160]:
left2.join([right2,another])

   ohio  nevada  missouri  alabama  newyork  oregon
a   1.0     2.0       NaN      NaN      7.0     8.0
c   3.0     4.0       9.0     10.0      9.0    10.0
e   5.0     6.0      13.0     14.0     11.0    12.0

In [161]:
left2.join([right2,another],how='outer')

   ohio  nevada  missouri  alabama  newyork  oregon
a   1.0     2.0       NaN      NaN      7.0     8.0
c   3.0     4.0       9.0     10.0      9.0    10.0
e   5.0     6.0      13.0     14.0     11.0    12.0
b   NaN     NaN       7.0      8.0      NaN     NaN
d   NaN     NaN      11.0     12.0      NaN     NaN
f   NaN     NaN       NaN      NaN     16.0    17.0

# Reshaping

In [162]:
data=pd.DataFrame(np.arange(6).reshape((2,3)),
                 index=pd.Index(['ohio','colorado'],name='state'),
                 columns=pd.Index(['one','two','three'],
                 name='number'))

In [163]:
data

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [164]:
result=data.stack()

In [165]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [166]:
result.unstack()

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [167]:
result.unstack(0)

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [168]:
result.unstack('state')

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [169]:
s1=pd.Series([0,1,2,3],index=['a','b','c','d'])

In [170]:
s2=pd.Series([4,5,6],index=['c','d','e'])

In [171]:
data2=pd.concat([s1,s2],keys=['one','two '])

In [172]:
data2

one   a    0
      b    1
      c    2
      d    3
two   c    4
      d    5
      e    6
dtype: int64

In [173]:
data2.unstack()

        a    b    c    d    e
one   0.0  1.0  2.0  3.0  NaN
two   NaN  NaN  4.0  5.0  6.0

In [174]:
data2.unstack().stack()

one   a    0.0
      b    1.0
      c    2.0
      d    3.0
two   c    4.0
      d    5.0
      e    6.0
dtype: float64

In [175]:
data2.unstack().stack(dropna=False)

one   a    0.0
      b    1.0
      c    2.0
      d    3.0
      e    NaN
two   a    NaN
      b    NaN
      c    4.0
      d    5.0
      e    6.0
dtype: float64

In [176]:
df=pd.DataFrame({'left':result,'right':result+5},
               columns=pd.Index(['left','right'],name='side'))

In [177]:
df

side             left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [178]:
df.unstack('state')

side   left          right
state  ohio colorado  ohio colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [179]:
df.unstack('state').stack('side')

state         colorado  ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

# combining data ith overlap

In [180]:
a=pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
           index=['f','e','d','c','b','a'])

In [181]:
b=pd.Series(np.arange(len(a),dtype=np.float64),
           index=['f','e','d','c','b','a'])

In [182]:
b[-1]=np.nan

In [183]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [184]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [185]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [186]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [187]:
df1=pd.DataFrame({'a':[1.,np.nan,5.,np.nan],
                 'b':[np.nan,2.,np.nan,6.],
                 'c':range(2,18,4)})

In [188]:
df2=pd.DataFrame({'a':[5.,4.,np.nan,3.,7.],
                 'b':[np.nan,3.,4.,6.,8.]})

In [189]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [190]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [191]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# concatenate

In [192]:
arr=np.arange(12).reshape((3,4))

In [193]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [194]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [195]:
s1=pd.Series([0,1],index=['a','b'])

In [196]:
s2=pd.Series([2,3,4],index=['c','d','e'])

In [197]:
s3=pd.Series([5,6],index=['f','g'])

In [198]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [199]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [200]:
s4=pd.concat([s1,s3])

In [201]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [202]:
s1

a    0
b    1
dtype: int64

In [203]:
s2

c    2
d    3
e    4
dtype: int64

In [204]:
s3

f    5
g    6
dtype: int64

In [205]:
pd.concat([s1,s4],axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [206]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  1

In [207]:
result=pd.concat([s1,s2,s3],keys=['one','two','three'])

In [208]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [209]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [210]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [211]:
df1=pd.DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],
                columns=['one','two'])

In [212]:
df2=pd.DataFrame(5+np.arange(4).reshape(2,2),index=['a','c'],
                columns=['three','four'])

In [213]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [214]:
df2

   three  four
a      5     6
c      7     8

In [215]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [216]:
pd.concat({'level1':df1,'level2':df2},axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [217]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],
         names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [218]:
df1=pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])
df2=pd.DataFrame(np.random.randn(2,3),columns=['b','d','a'])

In [219]:
df1

          a         b         c         d
0  1.161965  2.138214  0.919056  0.102335
1  2.060651  0.176652 -1.014264  1.148401
2 -1.346978 -0.359867 -0.111716  0.282163

In [220]:
df2

          b         d         a
0 -1.088576 -0.331537  1.231286
1  0.894791  0.389372  0.334788

In [221]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0  1.161965  2.138214  0.919056  0.102335
1  2.060651  0.176652 -1.014264  1.148401
2 -1.346978 -0.359867 -0.111716  0.282163
3  1.231286 -1.088576       NaN -0.331537
4  0.334788  0.894791       NaN  0.389372